{
  "name": "Mohd Rayyan",
  "email": "mr.rayyan2005@gmail.com",
  "phone": "+91 9897700760",
  "location": "Greater Noida, Uttar Pradesh",
  "currentRole": "Product Solution Engineer",
  "bio": "Developer skilled in Java, data structures and algorithms, and full-stack development (MERN). Proficient in SQL, RESTful APIs, and scalable application development. Currently interning at Juspay as a Product Solution Engineer.",
  "about": "Product Solution Engineer at Juspay working on backend services, API debugging, and performance optimization in real-time transaction systems. MERN stack developer with strong algorithmic problem-solving skills and experience in payment infrastructure.",
  "longAbout": "I'm a B.Tech Information Technology student at Noida Institute of Engineering & Technology with a CGPA of 8.71, currently working as a Product Solution Engineer Intern at Juspay since July 2025. At Juspay, I manage payment infrastructure for  international merchants, design and implement RESTful APIs for payments, refunds, and checkout SDKs, and collaborate with product and engineering teams to develop real-time payment solutions. My technical expertise spans full-stack development using the MERN stack, Java for Data Structures and Algorithms, and payment technologies including Payment Gateways, Merchant Onboarding, and Transaction Flows. I have solved 600+ DSA problems on LeetCode and GeeksforGeeks, demonstrating strong problem-solving skills. My projects include InsightCRM (AI-powered CRM with Gemini AI), RayyanEstate (full-stack real estate platform), and Sign Language Learner (ML-based web app), showcasing practical applications of my technical skills. I led a team to achieve Top 5 in the NSUT National Hackathon and actively contribute to real-time payment solutions in production environments.",
  "socialLinks": {
    "github": "https://github.com/mrrayyan2005",
    "linkedin": "https://www.linkedin.com/in/mohd-rayyan-380173285/",
    "leetcode": "https://leetcode.com/u/mrrayyan123/",
    "geeksforgeeks": "https://www.geeksforgeeks.org/user/mrrayyan/",
    "portfolio": "https://mohd-rayyan-portfolio.vercel.app/"
  }
}
