{
  "projects": [
    {
      "title": "InsightCRM",
      "shortDescription": "AI-powered CRM using React.js, Node.js, and MongoDB to automate marketing and enhance user engagement.",
      "longDescription": "Built an AI-powered CRM using React.js, Node.js, and MongoDB to automate marketing and enhance user engagement. Developed email tracking with seven fallback methods to ensure reliable analytics and audience insights. Created a rule builder and integrated Gemini AI for real-time segmentation and campaign optimization. Designed a responsive React dashboard with Recharts; deployed the backend on Render and the frontend on Vercel.",
      "skills": ["React.js", "Node.js", "MongoDB", "Gemini AI", "Tailwind CSS"],
      "liveDemoLink": "https://insight-crm-eight.vercel.app/",
      "githubLink": "https://github.com/mrrayyan2005/InsightCRM",
      "date": "August 2025"
    },
    {
      "title": "RayyanEstate",
      "shortDescription": "A full-stack real estate platform enabling property browsing, bookings, and preference management.",
      "longDescription": "Developed a full-stack real estate platform enabling property browsing, bookings, and preference management. Implemented JWT-based authentication and integrated Cloudinary for secure image uploads, improving backend reliability. Optimized API design and MongoDB queries to enhance backend performance and responsiveness.",
      "skills": ["MongoDB", "Node.js", "React", "Express.js", "Cloudinary", "JWT"],
      "liveDemoLink": "https://rayyan-estate.vercel.app/",
      "githubLink": "https://github.com/mrrayyan2005/RayyanEstate",
      "date": "January 2025"
    },
    {
      "title": "Sign Language Learner",
      "shortDescription": "ML-based web app to teach sign language using real-time hand gesture recognition via webcam.",
      "longDescription": "Created an ML-based web app to teach sign language using real-time hand gesture recognition via webcam. Developed a Flask backend and JavaScript frontend, integrating Keras CNN for accurate real-time sign detection.",
      "skills": ["Python", "Flask", "Keras", "JavaScript"],
      "liveDemoLink": "https://github.com/mrrayyan2005/learning-app-for-mute-and-deaf",
      "githubLink": "https://github.com/mrrayyan2005/learning-app-for-mute-and-deaf",
      "date": "September 2024"
    },
    
    {
      "title": "Examprep",
      "shortDescription": "Full-stack web application for competitive exam preparation with study management, progress tracking, and collaborative learning features.",
      "longDescription": "Developed a comprehensive study planner application designed for competitive exam preparation (UPSC, SSC, Banking, Railways). Built with Node.js/Express backend and React/TypeScript frontend, featuring study management, progress analytics, resource tracking, collaborative study groups, and real-time progress monitoring. Includes JWT authentication, Redux state management, and responsive UI with Tailwind CSS.",
      "skills": ["Node.js", "Express.js", "MongoDB", "React", "TypeScript", "Redux Toolkit", "Tailwind CSS", "JWT", "Vite"],
      "liveDemoLink": "https://exampreperation.vercel.app/",
      "githubLink": "https://github.com/mrrayyan2005/Examprep",
      "date": "April 2024"
    },
    {
      "title": "NeuraPrep",
      "shortDescription": "AI-powered mock interview platform using Gemini AI with personalized feedback and secure authentication.",
      "longDescription": "Developed an intelligent mock interview platform leveraging React for the frontend and Node.js for the backend. Integrated Gemini AI to generate personalized interview questions and provide contextual feedback based on user responses. Implemented Clerk for secure authentication with role-based access (admin, user). The platform features a dynamic dashboard to track user progress and stores session data and performance metrics in a cloud-connected database, enabling insightful analytics and continuous improvement.",
      "skills": ["React", "Node.js", "Clerk", "Gemini AI", "JavaScript"],
      "liveDemoLink": "https://ai-mock-interview-git-master-mohd-rayyans-projects.vercel.app/sign-in?redirect_url=https%3A%2F%2Fai-mock-interview-git-master-mohd-rayyans-projects.vercel.app%2Fdashboard",
      "githubLink": "https://github.com/mrrayyan2005/AI-mock-Interview",
      "date": "February 2024"
    }
  ]
}
