{
  "projects": [
    {
      "title": "RayyanEstate",
      "shortDescription": "A full-featured real estate platform enabling users to explore properties, book visits, and manage preferences.",
      "longDescription": "Developed a comprehensive real estate platform using MERN stack with JWT authentication for secure login and access control. Integrated Cloudinary for property image management and implemented favorite/booking features. Designed a modern UI with React and optimized MongoDB queries for performance. The platform allows users to seamlessly browse properties, save favorites, and schedule visits through an intuitive dashboard.",
      "skills": ["MongoDB", "Node.js", "React", "Express.js", "Cloudinary", "JWT"],
      "liveDemoLink": "https://rayyan-estate.vercel.app/"
    },
    {
      "title": "SignLearn",
      "shortDescription": "AI-powered sign language learning platform for deaf/mute individuals to learn English and Gujarati sign language.",
      "longDescription": "Built an accessible learning platform using Python, Flask and TensorFlow with accurate hand gesture recognition. Developed an intuitive UI and ranked Top 10 in SIH College-Level Hackathon among 100 teams. The system helps bridge communication gaps by teaching sign language through an easy-to-use interface designed specifically for non-technical users with accessibility needs.",
      "skills": ["Python", "Flask", "TensorFlow", "JavaScript"],
      "liveDemoLink": "https://github.com/mrrayyan2005/learning-app-for-mute-and-deaf"
    },
    {
  "title": "NeuraPrep",
  "shortDescription": "AI-powered mock interview platform using Gemini AI with personalized feedback and secure authentication.",
  "longDescription": "Developed an intelligent mock interview platform leveraging React for the frontend and Node.js for the backend. Integrated Gemini AI to generate personalized interview questions and provide contextual feedback based on user responses. Implemented Clerk for secure authentication with role-based access (admin, user). The platform features a dynamic dashboard to track user progress and stores session data and performance metrics in a cloud-connected database, enabling insightful analytics and continuous improvement.",
  "skills": ["React", "Node.js", "Clerk", "Gemini AI", "JavaScript"],
  "liveDemoLink": "https://ai-mock-interview-chi-five.vercel.app/dashboard"
}
  ]
}
